In [13]:
# Pandas deals with the following three data structures built on top of Numpy array:
# Series, DataFrame, Panel.

import numpy as np
import pandas as pd

# Series
# A Series can be defined as a one-dimensional array that is capable of storing various data types.
# pd.Series(data, index, dtype, copy)

# creating an empty Series
sa = pd.Series()
print(sa) # If you don't specify any dtype and any data, a series will be float.
# That's why you see this weird output.

Series([], dtype: float64)

/home/matteo/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:12: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  if sys.path[0] == '':

In [14]:
l0 = [12.0, 2478, 24.333 - 1j, 'hello world', {"name": 'Matteo', "surname": 'Di Cara', "birthday": '13091992'}]
sb = pd.Series(l0)
sb
# l is a mixed list passed as data. For this reason, dtype will be assigned dynamically.
# In this case, it will be Object.
# In any case, data can be any collection: list, dictionary, numpy array, etc.

0                                                   12
1                                                 2478
2                                          (24.333-1j)
3                                          hello world
4    {'name': 'Matteo', 'surname': 'Di Cara', 'birt...
dtype: object

In [15]:
l1 = [12.0, 2478, 24.333 - 1j, 'hello world', {"name": 'Matteo', "surname": 'Di Cara', "birthday": '13091992'}]
i0 = ['a', 'b', 'c', 'd', 'e']
sc = pd.Series(l1, i0)
sc # By passing i0 too, series has customized indeces now. 
# However, index must be as long as data. Otherwise, it will cause a fatal error.

a                                                   12
b                                                 2478
c                                          (24.333-1j)
d                                          hello world
e    {'name': 'Matteo', 'surname': 'Di Cara', 'birt...
dtype: object

In [16]:
i1 = ['a', 'b', 10, 20, 12-1j]
sd = pd.Series(index = i1)
print(sd) # You can create a Series just passing on a customized index list.
se = pd.Series('Matteo', i1)
print(se) # If you pass just a simple value as data, it will be associated to every index.

a         NaN
b         NaN
10        NaN
20        NaN
(12-1j)   NaN
dtype: float64
a          Matteo
b          Matteo
10         Matteo
20         Matteo
(12-1j)    Matteo
dtype: object

/home/matteo/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.

In [17]:
# Accessing a series elements
i2 = ['a', 'b', 10.48, 20, 12-1j] # indeces
l1 = [12.0, 2478, 24.333 - 1j, 'hello world', {"name": 'Matteo', "surname": 'Di Cara', "birthday": '13091992'}] # data
sf = pd.Series(l1, i2)
print(sf[12-1j]) # prints a value of a series by its index
print(sf[:3]) # prints all values of a series from 0 to 3. Every element has associated a numeric index too,
# in case index is not numeric already, for advanced indexing operations.
print(sf[:-2]) # prints all series elements but the last two.

{'name': 'Matteo', 'surname': 'Di Cara', 'birthday': '13091992'}
a                 12
b               2478
10.48    (24.333-1j)
dtype: object
a                 12
b               2478
10.48    (24.333-1j)
dtype: object

In [18]:
# A DataFrame is a two-dimensional data structure. 
# For this reason, data is aligned in a tabular fashion in rows and columns.
# You can think of it as an SQL table or a spreadsheet data representation.
# pd.DataFrame( data, index, columns, dtype, copy)

# Empty DataFrane
dfa = pd.DataFrame()
print(dfa)

Empty DataFrame
Columns: []
Index: []

In [19]:
l2 = [['java', 28000.80],['php', 22275.85],['python', 38032.75]] # list of listes
dfb = pd.DataFrame(l2)
print(dfb)
print(dfb[0]) # prints column 0
print(dfb[0][0]) # prints cell (0,0)

        0         1
0    java  28000.80
1     php  22275.85
2  python  38032.75
0      java
1       php
2    python
Name: 0, dtype: object
java

In [20]:
l2 = [['java', 28000.80],['php', 22275.85],['python', 38032.75]]
c0 = ["programming language", "median salary"]
dfc = pd.DataFrame(l2, columns = c0,)
print(dfc) # now it really looks like an sql table
print(dfc['median salary']) # prints column 'median salary' and its' details
print(dfc['median salary'][1])

  programming language  median salary
0                 java       28000.80
1                  php       22275.85
2               python       38032.75
0    28000.80
1    22275.85
2    38032.75
Name: median salary, dtype: float64
22275.85

In [21]:
l2 = [['java', 28000.80], ['php', 22275.85], ['python', 38032.75]]
c0 = ["programming language", "median salary"]
i3 = ["scenario A", "scenario B", "scenario C"]
dfc = pd.DataFrame(l2, index = i3, columns = c0, dtype=float)
print(dfc) # now it really looks like an sql table
print(dfc['median salary']) # prints column 'median salary' and its' details
print(dfc['median salary'][1])

           programming language  median salary
scenario A                 java       28000.80
scenario B                  php       22275.85
scenario C               python       38032.75
scenario A    28000.80
scenario B    22275.85
scenario C    38032.75
Name: median salary, dtype: float64
22275.85

In [40]:
# Just to be short, a dataframe is a list of series with two indexes. 

d0 = { # list of dictionaries
    "curve 1": ['app development', 28000.80],  
    "curve 2": ['wordpress websites', 22275.85], 
    "curve 3": ['data analysis', 38032.75], 
    "curve 4": 24886.32 # only one float value here, on purpose 
} 
i4 = ["buiseness field", "median junior salary, year 2019"]
dfd = pd.DataFrame(d0, index = i4) 
print(dfd)
dfd # look at 'scenario D' column

                                   A    B    C    D
buiseness field                  NaN  NaN  NaN  NaN
median junior salary, year 2019  NaN  NaN  NaN  NaN

                                   A    B    C    D
buiseness field                  NaN  NaN  NaN  NaN
median junior salary, year 2019  NaN  NaN  NaN  NaN

In [42]:
d0 = { # list of dictionaries
    "curve 1": ['app development', 28000.80],  
    "curve 2": ['wordpress websites', 22275.85], 
    "curve 3": ['data analysis', 38032.75], 
    "curve 4": 24886.32 # only one float value here, on purpose 
} 
i4 = ["buiseness field", "median junior salary, year 2019"]
c1 = ["A", "B", "C", "D"]
dfd = pd.DataFrame(d0, index = i4, columns = c1) 
print(dfd) # what happens if I want to impose other column names over d0 indeces
dfd

                                   A    B    C    D
buiseness field                  NaN  NaN  NaN  NaN
median junior salary, year 2019  NaN  NaN  NaN  NaN

                                   A    B    C    D
buiseness field                  NaN  NaN  NaN  NaN
median junior salary, year 2019  NaN  NaN  NaN  NaN

In [73]:
d1 = {
    'one' : pd.Series([1, 11, 111], index =[ 'r1', 'r2', 'r3'], dtype = float),
   'two' : pd.Series([2, 22, 222, 2222], index = [ 'r1', 'r2', 'r3', 'r4'], dtype = float)
}
dfe = pd.DataFrame(d1)
dfe['nine'] = pd.Series([9, 99, 999, 9999], index = ['r1', 'r2', 'r3', 'r4'], dtype = float) # adding a dataframe element
dfe['eleven'] = dfe['two'] + dfe['nine'] # creating a new column from two already existing ones
dfe['three'] = dfe['one'] + dfe['two'] # look at row 'r3': something + NaN = NaN, always
dfe

      one     two    nine   eleven  three
r1    1.0     2.0     9.0     11.0    3.0
r2   11.0    22.0    99.0    121.0   33.0
r3  111.0   222.0   999.0   1221.0  333.0
r4    NaN  2222.0  9999.0  12221.0    NaN